Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.Select Method
Overload List
Name | Description
Select()
 Selects an analysis model. Updates the model. The AnalysisModelName or ID has to be set.
 (Overrides AnalysisObject.Select().)
Select(Boolean)
 Selects an analysis model. The AnalysisModelName or ID has to be set.
Top
See Also
Reference
AnalysisModel Class
Tekla.Structures.Analysis Namespace